gtli1452/stm32f4_i2c/Src/spi.c
#include "spi.h"
#include "stm32f4xx.h"

/* PC3 is _CS */
#define _CS_IDLE GPIOC->ODR |= (1 << 3)
#define _CS_ACK GPIOC->ODR &= ~(1 << 3)

/* PC1 is SDO */
#define SDO_HIGH GPIOC->ODR |= (1 << 1)
#define SDO_LOW GPIOC->ODR &= ~(1 << 1)

/* PC15 is SCLK */
#define SCLK_HIGH GPIOC->ODR |= (1 << 15)
#define SCLK_LOW GPIOC->ODR &= ~(1 << 15)

/* PC13 is SDI */
#define SDI_READ GPIOC->IDR &(1 << 13)

/* PC14 is _RST */
#define _RST_IDLE GPIOC->ODR |= (1 << 14)
#define _RST_ACK GPIOC->ODR &= ~(1 << 14)

/* PA1 is _BUSY*/
#define _BUSY_READ ((GPIOA->IDR & (1 << 1)) == 0 ? 1 : 0)

/* tBUSW for /BUSY minimum SCLK cycle requirements */
#define tBUSW_REST 744
#define tBUSW_NOP 3
#define tBUSW_VALID_ADDR 3
#define tBUSW_DAC 18
#define tBUSW_VIL_VIH 21

volatile spi_packet_t sdo, sdi;

/* Delay time */
static void nop(uint16_t cnt)
{
    for (int i = 0; i < cnt; i++)
        __nop();
}

/*
 * The SCLK pin continues to operate for as long as the BUSY pin state remains
 * active (active low). This period of time is defined by the parameter tBUSW
 * and is defined in ADATE320 datasheet.
 */
static void release_busy(uint16_t sclk_cnt)
{
    for (int i = 0; i < sclk_cnt; i++) {
        SCLK_LOW;
        nop(0);
        SCLK_HIGH;
        nop(0);
    }
    SCLK_LOW;
}
